app/controllers/api/v1/articles_controller.rb

  def index
    articles = Article.order(updated_at: :desc)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC

  def create
    article = current_user.articles.create!(article_params)
---
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ABC"], ["body", "abc"], ["user_id", 1], ["created_at", "2023-12-02 10:48:01.962179"], ["updated_at", "2023-12-02 10:48:01.962179"]]

  def update
    @article = Article.find(params[:id])
    @article.update!(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "ABCDE"], ["body", "abcde"], ["updated_at", "2023-12-02 11:04:07.647636"], ["id", 9]]

  def destroy
    @article = Article.find(params[:id])
    @article.destroy!
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 5]]